#include <stdio.h>

void task1();
void task2();
void task3();
void homework();
int main() {
    task1();
    task2();
    task3();
    homework();
    return 0; // your code goes here
}
void task1() {
    printf("123\n"); // подзадание 1
    printf("1\n2\n3\n"); // подзадание 2
    printf("1\t\n\t2\t\n\t\t3\t\n"); // подзадание 3
    printf("%d\n %2d\n %4d\n %6d\n", 1, 2, 3, 4); // подзадание 4
    printf("%10.5f\n", 12.234657); // подзадание 5 и 6
    printf("Деление 7 на 5: %d\n", 7 / 5); // подзадание 7,8 
    printf("Умножение 2000 на 4: %d\n", 2000 * 4); // подзадание 9
    printf("%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000); // подзадание 9
    printf("%d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000); // подзадание 9/1
    printf("%f разделить %f равно %f\n ", 5., 2000000., 5. / 2000000); // подзадание 9/2
    printf("%g разделить %g равно %g\n", 5., 2000000., 5. / 2000000); // подзадание 9/3
    printf("%e разделить %e равно %e\n", 5., 2000000., 5. / 2000000); // подзадание 9/4
}
void task2() {
    int N = 20;
    int K = 27;
    printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
    printf("Идет %d минута сутак\n", 1440 - N * 60 - K);
    printf("До полуночи осталось %d часов и %d минут", 24 - N, 60 - K);
    printf("С 8.00 прошло %d секунд", (N - 8) * 3600 + K * 60);
    printf("Текущий час = %.2f суток и текущая минута = %.2f часа \n", (float) N / 24, (float) K / 60);
}
void task3() {
    int L = 1323;
    int n = 2;
    int k = 3;
    int m = 7;
    printf("данные: %d %d\n результат: %-+*.*f", n, L, (k + m + 2), m, (float) n / L);
}
void homework() {
        int A = 100;
        int B = 200;
        int C = 50;
        int D = 500;
        printf("Сумма %d в рублях\n", D - (A + B + C));
        }